var fontname = new Array(
		'Wellen-Schrift',
		'Kreis-Schrift',
		'Überkopf-Schrift',
		'Gothic-Schrift',
		'Symbol-Schrift',
		'Kompakt-Schrift',
		'Kult-Schrift',
		'Curly-Schrift',
		'Swirl-Schrift',
		'Mini-Schrift',
		'Tamil-Schrift',
		'Mirror-Schrift',
		'Mini-Schrift',
		'Kreis-Schrift',
		'Weird-Schrift',
		'Attila-Schrift',
		'Fantasy-Schrift',
		'Cool-Schrift',
		'Crazy-Schrift',
		'Verdrehte-Schrift',
		'Schreib-Schrift I',
		'Cute-Schrift',
		'Keltische Schrift',
		'Griechische Schrift',
		'Miniatur-Schrift',
		'Crazy-Schrift',
		'Krakel-Schrift',
		'Herz-Schrift',
		'China-Schrift',
		'Geschwungene-Schrift',
		'Grand-Schrift',
		'Skizzen-Schrift',
		'Schreib-Schrift II',
		'Teufels-Schrift',
		'Magie-Schrift',
		'Geheimschrift',
		'Writing I',
		'Medival',
		'Medival bold',
		'Writing II',
		'Simple Boxed Font',
		'Boxed Font'
		);
var normal = 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789()';
var fonts = [
	'ăƅčɗĕfğɦĭĵƙlɱňŏρỡřštŭνŵҳўžÁ฿ČĎĔŦĞĤĨĴĶĹМŃŐРQŔŚŤÚVŴЖŶŹθīƻǮ4567Ȣ9()',	// wave		- 0
	[ '𝕒','𝕓','𝕔','𝕕','𝕖','𝕗','𝕘','𝕙','𝕚','𝕛','𝕜','𝕝','𝕞','𝕟','𝕠',
		'𝕡','𝕢','𝕣','𝕤','𝕥','𝕦','𝕧','𝕨','𝕩','𝕪','𝕫',
		'𝔸','𝔹','ℂ','𝔻','𝔼','𝔽','𝔾','ℍ','𝕀','𝕁','𝕂','𝕃','𝕄','ℕ','𝕆',
		'ℙ','ℚ','ℝ','𝕊','𝕋','𝕌','𝕍','𝕎','𝕏','𝕐','ℤ',
		'𝟘','𝟙','𝟚','𝟛','𝟜','𝟝','𝟞','𝟟','𝟠','𝟡','𝟘' ],					// double NEW
	'ɐqɔpǝɟƃɥıſʞןɯuodbɹsʇnʌʍxʎzɐqɔpǝɟƃɥıſʞןɯuodbɹsʇnʌʍxʎz0123456789()',	// upside
	'αβcδεŦĝhιjκlʍπøρφƦ$†uυωχψzαβcδεŦĝhιjκlʍπøρφƦ$†uυωχψz012З456789()',	// gothic
	'ค๒ς๔єŦɠђเןкl๓ภ๏թợгรtยשฬאץzค๒ς๔єŦɠђเןкl๓ภ๏թợгรtยשฬאץz๏1Ձȝ456ฯȢ9()',	// symbol
	'αвcɔεғɢнıנκʟмпσρǫяƨтυνшхчzαвcɔεғɢнıנκʟмпσρǫяƨтυνшхчz012З456789()',	// compact
	'αႦƈԃҽϝɠԋιʝƙʅɱɳσρϙɾʂƚυʋɯxყȥαႦƈԃҽϝɠԋιʝƙʅɱɳσρϙɾʂƚυʋɯxყȥ૦١Ձ૩મƼେ7Ց୨()',	// cult
	'αв¢đefgħıנκłмиøρqяšтυνωχчzαв¢đefgħıנκłмиøρqяšтυνωχчzθΙ2ЭЧƼбלȣף()', // curly
	'คც८ძ૯Բ૭ҺɿʆқՆɱՈ૦ƿҩՐς੮υ౮ω૪עઽคც८ძ૯Բ૭ҺɿʆқՆɱՈ૦ƿҩՐς੮υ౮ω૪עઽ૦1૨૩456ך89()',	// swirl
	'ձъƈժεբցհﻨյĸlოռօթզгรէսνա×ყ২ձъƈժεբցհﻨյĸlოռօթզгรէսνա×ყ২º¹²³чƽ6789()',	// mini
	'ԹՅՇԺȝԲԳɧɿʝƙʅʍՌԾρφՐՏԵՄעաՃՎՀԹՅՇԺȝԲԳɧɿʝƙʅʍՌԾρφՐՏԵՄעաՃՎՀθΙՁკЧƼбלȣף()',	// tamil	- 10
	'ɒʚɔαɘʇϱнıįʞlмиoqpяƨтυvωxγzɒʚɔαɘʇϱнıįʞlмиoqpяƨтυvωxγz012З456789()',	// mirror
	'ᵃᵇᶜᵈᵉᶠᵍʰᶤʲᵏˡᵐᶰᵒᵖᵠʳˢᵗᵘᵛʷˣʸᶻᵃᵇᶜᵈᵉᶠᵍʰᶤʲᵏˡᵐᶰᵒᵖᵠʳˢᵗᵘᵛʷˣʸᶻ⁰¹²³⁴⁵⁶⁷⁸⁹⁽⁾',	// mini
	[ 'ⓐ','ⓑ','ⓒ','ⓓ','ⓔ','ⓕ','ⓖ','ⓗ','ⓘ','ⓙ','ⓚ','ⓛ','ⓜ','ⓝ','ⓞ',
		'ⓟ','ⓠ','ⓡ','ⓢ','ⓣ','ⓤ','ⓥ','ⓦ','ⓧ','ⓨ','ⓩ',
		'Ⓐ','Ⓑ','Ⓒ','Ⓓ','Ⓔ','Ⓕ','Ⓖ','Ⓗ','Ⓘ','Ⓙ','Ⓚ','Ⓛ','Ⓜ','Ⓝ','Ⓞ',
		'Ⓟ','Ⓠ','Ⓡ','Ⓢ','Ⓣ','Ⓤ','Ⓥ','Ⓦ','Ⓧ','Ⓨ','Ⓩ',
		'⓪','①','②','③','④','⑤','⑥','⑦','⑧','⑨', '(', ')' ],				// cycle
	'αв¢∂єƒgнιנкℓмησρqяѕтυνωχуzαв¢∂єƒgнιנкℓмησρqяѕтυνωχуz0123456789()',		// weird
	'ÁßČĎĔŦĞĤĨĴĶĹМŃŐРQŔŚŤÚVŴЖŶŹÁßČĎĔŦĞĤĨĴĶĹМŃŐРQŔŚŤÚVŴЖŶŹ0123456789()',		// attila
	'ค๒ς๔єŦﻮђเןкl๓ภ๏קợгรtยשฬץאzค๒ς๔єŦﻮђเןкl๓ภ๏קợгรtยשฬץאz0123456789()',		// fantasy
	'ΛБϾÐΞŦGHłJКŁMЛФPǪЯSТUVШЖЏZΛБϾÐΞŦGHłJКŁMЛФPǪЯSТUVШЖЏZ0123456789()',		// cool
	'ǞвटDęբg৸ijκlɱПΦРqЯsƮЦvЩжყւǞвटDęբg৸ijκlɱПΦРqЯsƮЦvЩжყւ0123456789()',		// crazy
	'αႦƈԃҽϝɠԋιʝƙʅɱɳσρϙɾʂƚυʋɯxყȥαႦƈԃҽϝɠԋιʝƙʅɱɳσρϙɾʂƚυʋɯxყȥ0123456789()',	// twisted
	'คც८ძ૯Բ૭ҺɿʆқՆɱՈ૦ƿҩՐς੮υ౮ω૪עઽคც८ძ૯Բ૭ҺɿʆқՆɱՈ૦ƿҩՐς੮υ౮ω૪עઽ0123456789()',		// write		- 20
	'ʌƅƈɗєƒʛɦɪʝƙʅɱɲơƥƣɾƨƭυvɯҳɣȥʌƅƈɗєƒʛɦɪʝƙʅɱɲơƥƣɾƨƭυvɯҳɣȥ0123456789()',		// cute
	'მჩƈძεբցհἶʝƙlოղօրգɾʂէմνωჯყzმჩƈძεբցհἶʝƙlოղօրգɾʂէմνωჯყz0123456789()',		// eltic
	'ΔƁCDΣFGHIJƘLΜ∏ΘƤႳΓЅƬƱƲШЖΨZΔƁCDΣFGHIJƘLΜ∏ΘƤႳΓЅƬƱƲШЖΨZ0123456789()',		// greek
	'ᴬᴮᶜᴰᴱᶠᴳᴴᴵᴶᴷᴸᴹᴺᴼᴾᵠᴿˁᵀᵁᵛᵂˣʸᶻᴬᴮᶜᴰᴱᶠᴳᴴᴵᴶᴷᴸᴹᴺᴼᴾᵠᴿˁᵀᵁᵛᵂˣʸᶻ⁰¹²³⁴⁵⁶⁷⁸⁹⁽⁾',		// miniatur
	'Дþ¢Ð3ƒgђîjkℓм₪øÞQЯ§†û√w×¥žДþ¢Ð3ƒgђîjkℓм₪øÞQЯ§†û√w×¥ž0ı2ʓ45бך89()',		// crazy
	'ﻪъ८ժεքցհﻨյĸlოռօթզгรէսνա〤կչﻪъ८ժεքցհﻨյĸlოռօթզгรէսνա〤կչ0ı2ʓ45бך89()',	// krakel
	'ΛßƇDƐFƓĤĪĴҠĿMИოṖҨŔSŦƱ√ѠӾYZΛßƇDƐFƓĤĪĴҠĿMИოṖҨŔSŦƱ√ѠӾYZ0ı2ʓ45бך89()',		// love
	'ﾑ乃ζÐ乇ｷǤんﾉﾌズﾚᄊ刀ԾｱQ尺丂ｲЦЏЩﾒﾘ乙ﾑ乃ζÐ乇ｷǤんﾉﾌズﾚᄊ刀ԾｱQ尺丂ｲЦЏЩﾒﾘ乙ᅙ1ᆯЗ456ᆨ89()',	// china
	'ԹՅՇԺȝԲԳɧɿʝƙʅʍՌԾρφՐՏԵՄעաՃՎՀԹՅՇԺȝԲԳɧɿʝƙʅʍՌԾρφՐՏԵՄעաՃՎՀθΙՁკЧƼбלȣף()',		// swinging
	'ᗩ♭ᑥđĕſƓꀌĨĵƘŁɱƝōƤƢᖆƧŢᑌƔŵ྾ŶŹᗩ♭ᑥđĕſƓꀌĨĵƘŁɱƝōƤƢᖆƧŢᑌƔŵ྾ŶŹ0123456789()',	// grand	- 30
	'ᗑቄ￠꒯ﾼ￡ﻯꎧｴ｣ｋ꒒⋔ℕꑙℙ℺ℜ꒚ￓ꒤꒷꒳꒽ꐮẔᗑቄ￠꒯ﾼ￡ﻯꎧｴ｣ｋ꒒⋔ℕꑙℙ℺ℜ꒚ￓ꒤꒷꒳꒽ꐮẔ0123456789()',	// sketch
	'ᏗᏰፈᎴᏋᎦᎥᏂᎥᏠᏦᏝᎷᏁᎧᎮᎤᏒᏕᏖᏬᏉᏇጀᎩፚᏗᏰፈᎴᏋᎦᎥᏂᎥᏠᏦᏝᎷᏁᎧᎮᎤᏒᏕᏖᏬᏉᏇጀᎩፚ0123456789《》',	// write
	'ⓐßʗðⓔƒɠнìʖҜℓмиѺρҨяƧ†µƔŴӾ¥ẕⓐßʗðⓔƒɠнìʖҜℓмиѺρҨяƧ†µƔŴӾ¥ẕ0ı2ʓ45бך89()',	// devil
	'Λв¢∂єƒgнιנкℓмηΩρqяѕтυνωχуzΛв¢∂єƒgнιנкℓмηΩρqяѕтυνωχуz0123456789()',		// magie
	'=.er>bn?ux@s*,f!y(ck<h-)ip+ogltdam zvqwj=.er>bn?ux@s*,f!y(ck<h-)ip+ogltdam zvqwj0123456789()',	// secret
	[ '𝒶','𝒷','𝒸','𝒹','𝑒','𝒻','𝑔','𝒽','𝒾','𝒿','𝓀','𝓁','𝓂','𝓃','𝑜','𝓅','𝓆','𝓇','𝓈','𝓉','𝓊','𝓋','𝓌','𝓍','𝓎','𝓏',
		'𝒜','𝐵','𝒞','𝒟','𝐸','𝐹','𝒢','𝐻','𝐼','𝒥','𝒦','𝐿','𝑀','𝒩','𝒪','𝒫','𝒬','𝑅','𝒮','𝒯','𝒰','𝒱','𝒲','𝒳','𝒴','𝒵',
		'𝟢','𝟣','𝟤','𝟥','𝟦','𝟧','𝟨','𝟩','𝟪','𝟫' ],			// writing NEW
	[ '𝔞','𝔟','𝔠','𝔡','𝔢','𝔣','𝔤','𝔥','𝔦','𝔧','𝔨','𝔩','𝔪','𝔫','𝔬','𝔭','𝔮','𝔯','𝔰','𝔱','𝔲','𝔳','𝔴','𝔵','𝔶','𝔷',
		'𝔄','𝔅','ℭ','𝔇','𝔈','𝔉','𝔊','ℌ','ℑ','𝔍','𝔎','𝔏','𝔐','𝔑','𝔒','𝔓','𝔔','ℜ','𝔖','𝔗','𝔘','𝔙','𝔚','𝔛','𝔜','ℨ',
		'0','1','2','3','4','5','6','7','8','9','(',')' ], // mdevial NEW
	[ '𝖆','𝖇','𝖈','𝖉','𝖊','𝖋','𝖌','𝖍','𝖎','𝖏','𝖐','𝖑','𝖒','𝖓','𝖔','𝖕','𝖖','𝖗','𝖘','𝖙','𝖚','𝖛','𝖜','𝖝','𝖞','𝖟',
		'𝕬','𝕭','𝕮','𝕯','𝕰','𝕱','𝕲','𝕳','𝕴','𝕵','𝕶','𝕷','𝕸','𝕹','𝕺','𝕻','𝕼','𝕽','𝕾','𝕿','𝖀','𝖁','𝖂','𝖃','𝖄','𝖅',
		'0','1','2','3','4','5','6','7','8','9','(',')' ], // medival bold NEW
	[ '𝓪','𝓫','𝓬','𝓭','𝓮','𝓯','𝓰','𝓱','𝓲','𝓳','𝓴','𝓵','𝓶','𝓷','𝓸','𝓹','𝓺','𝓻','𝓼','𝓽','𝓾','𝓿','𝔀','𝔁','𝔂','𝔃',
		'𝓐','𝓑','𝓒','𝓓','𝓔','𝓕','𝓖','𝓗','𝓘','𝓙','𝓚','𝓛','𝓜','𝓝','𝓞','𝓟','𝓠','𝓡','𝓢','𝓣','𝓤','𝓥','𝓦','𝓧','𝓨','𝓩',
		'0','1','2','3','4','5','6','7','8','9','(',')' ],	// writing II NEW
	[ '[̲̅a̲̅]','[̲̅b̲̅]','[̲̅c̲̅]','[̲̅d̲̅]','[̲̅e̲̅]','[̲̅f̲̅]','[̲̅g̲̅]','[̲̅h̲̅]','[̲̅i̲̅]',
		'[̲̅j̲̅]','[̲̅k̲̅]','[̲̅l̲̅]','[̲̅m̲̅]','[̲̅n̲̅]','[̲̅o̲̅]','[̲̅p̲̅]','[̲̅q̲̅]','[̲̅r̲̅]','[̲̅s̲̅]','[̲̅t̲̅]','[̲̅u̲̅]','[̲̅v̲̅]',
		'[̲̅w̲̅]','[̲̅x̲̅]','[̲̅y̲̅]','[̲̅z̲̅]','[̲̅a̲̅]','[̲̅b̲̅]','[̲̅c̲̅]','[̲̅d̲̅]','[̲̅e̲̅]','[̲̅f̲̅]','[̲̅g̲̅]','[̲̅h̲̅]','[̲̅i̲̅]',
		'[̲̅j̲̅]','[̲̅k̲̅]','[̲̅l̲̅]','[̲̅m̲̅]','[̲̅n̲̅]','[̲̅o̲̅]','[̲̅p̲̅]','[̲̅q̲̅]','[̲̅r̲̅]','[̲̅s̲̅]','[̲̅t̲̅]','[̲̅u̲̅]','[̲̅v̲̅]',
		'[̲̅w̲̅]','[̲̅x̲̅]','[̲̅y̲̅]','[̲̅z̲̅]','0','1','2','3','4','5','6','7','8','9','(',')' ],	// simple box	- 40
	[ '🅰','🅱','🅲','🅳','🅴','🅵','🅶','🅷','🅸','🅹','🅺','🅻','🅼','🅽','🅾','🅿','🆀','🆁','🆂','🆃','🆄','🆅','🆆','🆇','🆈','🆉',
		'🅰','🅱','🅲','🅳','🅴','🅵','🅶','🅷','🅸','🅹','🅺','🅻','🅼','🅽','🅾','🅿','🆀','🆁','🆂','🆃','🆄','🆅','🆆','🆇','🆈','🆉',
		'1','2','3','4','5','6','7','8','9','0','(',')' ]	// box
];

function clean() {
	var input = document.getElementById( "normal" );
	if( input.value === "Type your text here!"
		|| input.value === "Hier Text eingeben!"
		|| input.value === "Pon aqui tu texto!"
	) {
		input.value = "";
		try {
			ga( 'send', 'event', 'Interaction', 'Starting input', 'Eingabefeld erstmals aktiviert' );
		} catch( e ){}
	} else {
		try {
			ga( 'send', 'event', 'Interaction', 'Activate input again', 'Eingabefeld erneut aktiviert' );
		} catch( e ){}
	}
}

function cleanInput( input ) {

	// spanish
	input = input.replace( /ñ/g, 'n' );	input = input.replace( /Ñ/g, 'N' );
	input = input.replace( /¡/g, 'i' );	input = input.replace( /á/g, 'a' );
	input = input.replace( /Á/g, 'A' );	input = input.replace( /é/g, 'e' );
	input = input.replace( /É/g, 'E' );	input = input.replace( /í/g, 'i' );
	input = input.replace( /Í/g, 'I' );	input = input.replace( /ó/g, 'o' );
	input = input.replace( /Ó/g, 'O' );	input = input.replace( /ú/g, 'u' );
	input = input.replace( /Ú/g, 'U' );

	// francaise
	input = input.replace( /À/g, 'A' );	input = input.replace( /à/g, 'a' );
	input = input.replace( /Â/g, 'A' );	input = input.replace( /â/g, 'a' );
	input = input.replace( /Æ/g, 'Ae' );input = input.replace( /æ/g, 'ae' );
	input = input.replace( /Ç/g, 'C' );	input = input.replace( /ç/g, 'c' );
	input = input.replace( /È/g, 'E' );	input = input.replace( /è/g, 'e' );
	input = input.replace( /É/g, 'E' );	input = input.replace( /é/g, 'e' );
	input = input.replace( /Ê/g, 'E' );	input = input.replace( /ê/g, 'e' );
	input = input.replace( /Ë/g, 'E' );	input = input.replace( /ë/g, 'e' );
	input = input.replace( /Î/g, 'I' );	input = input.replace( /î/g, 'i' );
	input = input.replace( /Ï/g, 'I' );	input = input.replace( /ï/g, 'i' );
	input = input.replace( /Ô/g, 'O' );	input = input.replace( /ô/g, 'o' );
	input = input.replace( /Œ/g, 'Oe' );input = input.replace( /œ/g, 'oe' );
	input = input.replace( /Ù/g, 'U' );	input = input.replace( /ù/g, 'u' );
	input = input.replace( /Û/g, 'U' );	input = input.replace( /û/g, 'u' );
	input = input.replace( /Ÿ/g, 'Y' );	input = input.replace( /ÿ/g, 'y' );

	return input;
}

function replace_schrift() {
	var input = cleanInput( document.getElementById("normal").value );
//	console.log(input);

	var inputLength = input.length;
	var fontCount = fonts.length;
	for( var f=0; f<fontCount; ++f ) {
		var output = '';
		for( var i=0; i<inputLength; ++i ) {
			output += getLetter( normal, fonts[f], input.charAt( i ) );
		}
		try {
			document.getElementById( "font_"+f ).value = output;
		} catch( e ){}
	}
}

function getLetter( normal, target, letter ) {
	var length = normal.length;
	for( var i=0; i<length; ++i ) {
		if( normal.charAt(i) === letter ) {
			if( Array.isArray( target ) ) {
				return target[i];
			}
			return target.charAt( i );
		}
	}
	return letter;
}
function get( obj ) {
	obj.select();
	var id = obj.id.replace('font_','');
	try {
		ga( 'send', 'event', 'Interaction', 'Activate ' + id + ': '
				+ fontname[id], 'Feld ' + fontname[id] + ' aktiviert' );
	}catch( e ) {}
}

function copy(obj) {
	var id = obj.id.replace('copy_', '');
	try {
		ga( 'send', 'event', 'Interaction', 'Copy ' + id + ': '
				+ fontname[id], 'Feld ' + fontname[id] + ' kopiert' );
	}catch( err ) {}
}

function start_replace_schrift() {
	var fontCount = fonts.length;
	for( var f=0; f<fontCount; ++f ) {
		try {
			var input = document.getElementById("font_"+f).value;
			var inputLength = input.length;
			var output = '';
			for( var i=0; i<inputLength; ++i ) {
				output += getLetter( normal, fonts[f], input.charAt( i ) );
			}
			document.getElementById( "font_"+f ).value = output;
		} catch( e ) {
//			return;
		}
	}
}
start_replace_schrift();

var counter = 0;
var step = 30;
var visit = window.setInterval( "duration()", 1000 * step );

function duration() {
	counter = counter + 1;
	if( counter > 19 ) {
		window.clearInterval( visit );
	}
	try {
		ga( 'send', 'event', 'reading', 'duration in seconds: ' + ( counter * step ), 'visit duration on page' );
	} catch( e ) {}
